social_net/perf_testing/data/composePost/202404261003_320_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 2198.067ms, rate sampling interval: 8413ms
  Thread calibration: mean lat.: 1795.066ms, rate sampling interval: 7655ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.30s     6.00s   26.49s    58.32%
    Req/Sec    19.75      6.50    28.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.12s 
 75.000%   20.15s 
 90.000%   22.90s 
 99.000%   26.49s 
 99.900%   27.36s 
 99.990%   27.93s 
 99.999%   27.93s 
100.000%   27.93s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5079.039     0.000000            1         1.00
    7667.711     0.100000           72         1.11
    8683.519     0.200000          143         1.25
    9961.471     0.300000          215         1.43
   10452.991     0.400000          286         1.67
   12124.159     0.500000          358         2.00
   13180.927     0.550000          394         2.22
   15130.623     0.600000          429         2.50
   17858.559     0.650000          465         2.86
   19382.271     0.700000          502         3.33
   20201.471     0.750000          537         4.00
   20578.303     0.775000          556         4.44
   20971.519     0.800000          573         5.00
   21430.271     0.825000          590         5.71
   21757.951     0.850000          608         6.67
   22282.239     0.875000          628         8.00
   22560.767     0.887500          635         8.89
   22904.831     0.900000          644        10.00
   23134.207     0.912500          653        11.43
   23461.887     0.925000          662        13.33
   23855.103     0.937500          671        16.00
   24018.943     0.943750          675        17.78
   24346.623     0.950000          681        20.00
   24494.079     0.956250          685        22.86
   24903.679     0.962500          689        26.67
   25165.823     0.968750          693        32.00
   25264.127     0.971875          695        35.56
   25460.735     0.975000          698        40.00
   25559.039     0.978125          701        45.71
   25706.495     0.981250          702        53.33
   25952.255     0.984375          704        64.00
   25985.023     0.985938          705        71.11
   26132.479     0.987500          707        80.00
   26492.927     0.989062          708        91.43
   26722.303     0.990625          709       106.67
   26755.071     0.992188          710       128.00
   26755.071     0.992969          710       142.22
   26886.143     0.993750          711       160.00
   26968.063     0.994531          712       182.86
   26968.063     0.995313          712       213.33
   27262.975     0.996094          713       256.00
   27262.975     0.996484          713       284.44
   27262.975     0.996875          713       320.00
   27361.279     0.997266          714       365.71
   27361.279     0.997656          714       426.67
   27361.279     0.998047          714       512.00
   27361.279     0.998242          714       568.89
   27361.279     0.998437          714       640.00
   27934.719     0.998633          715       731.43
   27934.719     1.000000          715          inf
#[Mean    =    14296.140, StdDeviation   =     5997.138]
#[Max     =    27918.336, Total count    =          715]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  861 requests in 30.05s, 273.58KB read
  Socket errors: connect 0, read 0, write 0, timeout 3
  Non-2xx or 3xx responses: 395
Requests/sec:     28.65  
Transfer/sec:      9.10KB