social_net/perf_testing/data/composePost/202404261008_400_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 2302.211ms, rate sampling interval: 9428ms
  Thread calibration: mean lat.: 3074.587ms, rate sampling interval: 16097ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.57s     5.92s   26.26s    62.45%
    Req/Sec    18.33      3.30    22.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.54s 
 75.000%   19.86s 
 90.000%   22.89s 
 99.000%   26.26s 
 99.900%   27.92s 
 99.990%   28.38s 
 99.999%   28.38s 
100.000%   28.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5468.159     0.000000            1         1.00
    7954.431     0.100000           72         1.11
    9060.351     0.200000          143         1.25
   10027.007     0.300000          220         1.43
   10715.135     0.400000          285         1.67
   12541.951     0.500000          356         2.00
   14163.967     0.550000          392         2.22
   17006.591     0.600000          427         2.50
   18333.695     0.650000          464         2.86
   19185.663     0.700000          498         3.33
   19890.175     0.750000          534         4.00
   20529.151     0.775000          552         4.44
   20905.983     0.800000          571         5.00
   21413.887     0.825000          588         5.71
   21790.719     0.850000          605         6.67
   22265.855     0.875000          623         8.00
   22691.839     0.887500          632         8.89
   22888.447     0.900000          640        10.00
   23248.895     0.912500          649        11.43
   23429.119     0.925000          658        13.33
   23805.951     0.937500          667        16.00
   24084.479     0.943750          672        17.78
   24264.703     0.950000          677        20.00
   24543.231     0.956250          680        22.86
   24920.063     0.962500          685        26.67
   25165.823     0.968750          689        32.00
   25296.895     0.971875          692        35.56
   25477.119     0.975000          694        40.00
   25526.271     0.978125          697        45.71
   25559.039     0.981250          698        53.33
   25755.647     0.984375          701        64.00
   25919.487     0.985938          702        71.11
   26066.943     0.987500          703        80.00
   26263.551     0.989062          704        91.43
   26771.455     0.990625          705       106.67
   26886.143     0.992188          706       128.00
   27230.207     0.992969          707       142.22
   27230.207     0.993750          707       160.00
   27541.503     0.994531          708       182.86
   27541.503     0.995313          708       213.33
   27705.343     0.996094          709       256.00
   27705.343     0.996484          709       284.44
   27705.343     0.996875          709       320.00
   27918.335     0.997266          710       365.71
   27918.335     0.997656          710       426.67
   27918.335     0.998047          710       512.00
   27918.335     0.998242          710       568.89
   27918.335     0.998437          710       640.00
   28377.087     0.998633          711       731.43
   28377.087     1.000000          711          inf
#[Mean    =    14572.206, StdDeviation   =     5920.960]
#[Max     =    28360.704, Total count    =          711]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  867 requests in 30.05s, 274.89KB read
  Non-2xx or 3xx responses: 408
Requests/sec:     28.85  
Transfer/sec:      9.15KB