social_net/perf_testing/data/composePost/202404261009_430_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1695.293ms, rate sampling interval: 8065ms
  Thread calibration: mean lat.: 2124.817ms, rate sampling interval: 9232ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.59s     5.55s   25.84s    59.62%
    Req/Sec    19.00      7.07    31.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.12s 
 75.000%   20.32s 
 90.000%   22.53s 
 99.000%   25.84s 
 99.900%   27.26s 
 99.990%   27.79s 
 99.999%   27.79s 
100.000%   27.79s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5873.663     0.000000            1         1.00
    8544.255     0.100000           69         1.11
    9838.591     0.200000          138         1.25
   10231.807     0.300000          205         1.43
   10993.663     0.400000          273         1.67
   12124.159     0.500000          342         2.00
   13189.119     0.550000          375         2.22
   15515.647     0.600000          409         2.50
   17924.095     0.650000          443         2.86
   19333.119     0.700000          477         3.33
   20316.159     0.750000          511         4.00
   20660.223     0.775000          528         4.44
   21004.287     0.800000          546         5.00
   21397.503     0.825000          562         5.71
   21823.487     0.850000          579         6.67
   22167.551     0.875000          597         8.00
   22347.775     0.887500          606         8.89
   22527.999     0.900000          613        10.00
   22691.839     0.912500          622        11.43
   22872.063     0.925000          631        13.33
   23085.055     0.937500          640        16.00
   23150.591     0.943750          645        17.78
   23199.743     0.950000          647        20.00
   23576.575     0.956250          652        22.86
   23887.871     0.962500          656        26.67
   24215.551     0.968750          660        32.00
   24379.391     0.971875          662        35.56
   24674.303     0.975000          664        40.00
   24756.223     0.978125          668        45.71
   24838.143     0.981250          669        53.33
   25362.431     0.984375          671        64.00
   25411.583     0.985938          672        71.11
   25673.727     0.987500          673        80.00
   25837.567     0.989062          674        91.43
   25903.103     0.990625          675       106.67
   26165.247     0.992188          676       128.00
   26558.463     0.992969          677       142.22
   26558.463     0.993750          677       160.00
   26656.767     0.994531          678       182.86
   26656.767     0.995313          678       213.33
   26804.223     0.996094          679       256.00
   26804.223     0.996484          679       284.44
   26804.223     0.996875          679       320.00
   27262.975     0.997266          680       365.71
   27262.975     0.997656          680       426.67
   27262.975     0.998047          680       512.00
   27262.975     0.998242          680       568.89
   27262.975     0.998437          680       640.00
   27787.263     0.998633          681       731.43
   27787.263     1.000000          681          inf
#[Mean    =    14589.293, StdDeviation   =     5552.758]
#[Max     =    27770.880, Total count    =          681]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  813 requests in 30.05s, 258.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 358
Requests/sec:     27.05  
Transfer/sec:      8.61KB