social_net/perf_testing/data/composePost/202404261013_500_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1724.390ms, rate sampling interval: 5906ms
  Thread calibration: mean lat.: 1637.709ms, rate sampling interval: 7086ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.29s     5.61s   25.95s    61.51%
    Req/Sec    22.20     12.54    39.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.06s 
 75.000%   19.68s 
 90.000%   22.81s 
 99.000%   25.95s 
 99.900%   27.12s 
 99.990%   27.62s 
 99.999%   27.62s 
100.000%   27.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6684.671     0.000000            1         1.00
    8327.167     0.100000           81         1.11
    9265.151     0.200000          163         1.25
   10117.119     0.300000          245         1.43
   10829.823     0.400000          325         1.67
   12058.623     0.500000          404         2.00
   13066.239     0.550000          445         2.22
   13959.167     0.600000          485         2.50
   15384.575     0.650000          526         2.86
   17891.327     0.700000          567         3.33
   19677.183     0.750000          606         4.00
   20332.543     0.775000          627         4.44
   21004.287     0.800000          647         5.00
   21544.959     0.825000          667         5.71
   21970.943     0.850000          687         6.67
   22413.311     0.875000          708         8.00
   22626.303     0.887500          718         8.89
   22839.295     0.900000          728        10.00
   23232.511     0.912500          738        11.43
   23560.191     0.925000          748        13.33
   23969.791     0.937500          760        16.00
   24068.095     0.943750          763        17.78
   24248.319     0.950000          768        20.00
   24395.775     0.956250          773        22.86
   24592.383     0.962500          778        26.67
   24723.455     0.968750          783        32.00
   24903.679     0.971875          786        35.56
   25001.983     0.975000          788        40.00
   25067.519     0.978125          791        45.71
   25182.207     0.981250          793        53.33
   25460.735     0.984375          796        64.00
   25493.503     0.985938          797        71.11
   25559.039     0.987500          798        80.00
   25952.255     0.989062          800        91.43
   26066.943     0.990625          801       106.67
   26214.399     0.992188          802       128.00
   26329.087     0.992969          803       142.22
   26329.087     0.993750          803       160.00
   26509.311     0.994531          804       182.86
   26705.919     0.995313          805       213.33
   26705.919     0.996094          805       256.00
   27066.367     0.996484          806       284.44
   27066.367     0.996875          806       320.00
   27066.367     0.997266          806       365.71
   27115.519     0.997656          807       426.67
   27115.519     0.998047          807       512.00
   27115.519     0.998242          807       568.89
   27115.519     0.998437          807       640.00
   27115.519     0.998633          807       731.43
   27623.423     0.998828          808       853.33
   27623.423     1.000000          808          inf
#[Mean    =    14286.686, StdDeviation   =     5608.186]
#[Max     =    27607.040, Total count    =          808]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  952 requests in 30.05s, 300.19KB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 421
Requests/sec:     31.68  
Transfer/sec:      9.99KB